In [185]:
from sklearn import datasets
from sklearn.metrics import r2_score
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
import pandas as pd
import matplotlib.pyplot as plt

In [186]:
ml = pd.read_csv(r'C:\Users\USER\Desktop\ml practice\Visitor_Prediction_Multiple_Linear_Regression_data.csv')

In [187]:
ml.head()

,Date,Views_show,Visitors,Views_platform,Ad_impression,Cricket_match_india,Character_A,Unnamed: 7
0,3/1/2017,183738,1260228,1706478,1060860448,0,0,NaN
1,3/2/2017,193763,1270561,1690727,1031846645,0,0,NaN
2,3/3/2017,210479,1248183,1726157,1010867575,0,0,NaN
3,3/4/2017,240061,1492913,1855353,1079194579,1,0,NaN
4,3/5/2017,446314,1594712,2041418,1357736987,0,0,NaN

In [208]:
ml.rename( columns={"Unnamed: 7":'new ',"Visitors":"z_visitors","Date":"AA date"}, inplace=True )

In [209]:
ml.head()

,Ad_impression,Character_A,Cricket_match_india,AA date,Views_platform,Views_show,new,z_visitors
0,1060860448,0,0,3/1/2017,1706478,183738,NaN,1260228
1,1031846645,0,0,3/2/2017,1690727,193763,NaN,1270561
2,1010867575,0,0,3/3/2017,1726157,210479,NaN,1248183
3,1079194579,0,1,3/4/2017,1855353,240061,NaN,1492913
4,1357736987,0,0,3/5/2017,2041418,446314,NaN,1594712

In [210]:
df=ml.fillna(0)

In [211]:
df=df.sort_index(axis=1, ascending=True)

In [212]:
df.head()

,AA date,Ad_impression,Character_A,Cricket_match_india,Views_platform,Views_show,new,z_visitors
0,3/1/2017,1060860448,0,0,1706478,183738,0.0,1260228
1,3/2/2017,1031846645,0,0,1690727,193763,0.0,1270561
2,3/3/2017,1010867575,0,0,1726157,210479,0.0,1248183
3,3/4/2017,1079194579,0,1,1855353,240061,0.0,1492913
4,3/5/2017,1357736987,0,0,2041418,446314,0.0,1594712

In [250]:
x=df.iloc[:,1:-1].values
y=df.iloc[:,7:8].values

In [251]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=.2, random_state=11)

In [255]:
regressor = LinearRegression()
regressor.fit(x_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [256]:
y_predictions=regressor.predict(x_test)

In [257]:
r2_score(y_test,y_predictions)

0.9165136688788389

In [259]:
y_predictions[0]

array([1741697.42036515])